# HandrailSupportsSpacingParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..HandrailSupportsSpacingParam Property
ParameterTypeId Class See Also
---
"Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId HandrailSupportsSpacingParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HandrailSupportsSpacingParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HandrailSupportsSpacingParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace